# print(100/0)
# try:
#     print(100/1)
# except ZeroDivisionError:
#     print('вы делите на ноль')

# my_dict = {'a': 1, 'b': 2, 'c': 3}
# try:
#     val = my_dict['d']
# except KeyError:
#     print('Key doesnt exist')
#
#
# my_list = [1,2,3,4,5]
# try:
#     print(my_list[6])
# except IndexError:
#     print('This index not exist')

#
# Задание No3
#
# Введите два числа с клавиатуры. Ȃоделите одно на другое.
# ȁбработайте ошибку деления на ноль, если ошибок нет, то результат
# деления возвести в квадрат. ȅакже используйте оператор finally.
# try:
#     a = int(input("Enter the number:"))
#     b = int(input("Enter the number:"))
#     k = a/b
# except ZeroDivisionError:
#     print("Division error")
# else:
#     print(k**2)
# finally:
#     print('end')
#
# Задание No4
#
# Введите два числа с клавиатуры. Ȃоделите одно на другое.
# ȁбработайте деления на ноль, преобразования и общее исключение.
# try:
#     c = int(input("Enter the number 1:"))
#     d = int(input("Enter the number 2:"))
#     t = c / d
#     print(t)
# except ZeroDivisionError:
#     print("Zero Division error")
# except TypeError:
#     print('Check the type')
# except Exception:
#     print('Error')
#
# finally:
#     print('END')

# Ввод с клавиатуры. Если строка введённая с клавиатуры –
# это числа, то поделить первое на второе. ȁбработать
# ошибку деления на ноль. Если второе число 0, то
# программа запрашивает ввод чисел заново. ȅакже если
# были введены буквы, то обработать исключение.

try:
    def
    inf = input("Enter the information:")

